<?php

/*
 * statuses parameters
 */

$errors = array(
    1 => 'קריאה לפונקציה לא ידועה',
    2 => 'לא נבחרה שום פעולה',
    3 => 'לא נשלחו כל הפרטים הדרושים לפעולה',
    4 => 'UUID שונה בעת התחברות',
    5 => 'המשתמש לא פעיל',
    6 => 'בעיה בבסיס הנתונים',
    7 => 'אין הרשאה להשתמש באזור הניהול',
    8 => 'הטוקן והמשתמש לא מתאימים',
    9 => 'למשתמש אין הרשאה להוסיף זאת',
    10 => 'המפתח לא קיים',
    11 => 'כמות המפתחות לא זהה לכמות הערכים',
    12 => 'המשתמש אינו איש מכירות',
    13 => 'לא הוחזרו תוצאות מבסיס הנתונים'
);